tutorials/DXIsoFlow/massSourceWavemaker/system/topoSetDict0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {   // free surface
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
		box (0 -1 -0.05) (100 1 0.05);
        }
    }
    {   // source region
        name    c1;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
		box (6.56 -1 -0.5) (6.78  1 -0.05); 
        }
    }
);

// ************************************************************************* //
